{
  "backend/main.mo": "Main Motoko actor defining all types (Designer, ProjectBrief, Order, Product, etc.) and managing designer selections with a stable map keyed by Principal.",
  "feature_evidence.json": "Feature evidence report documenting the removal of tab navigation from the Designers and Design Packages dropdown, replacing it with direct links to /designers and /packages pages.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, components, hooks, pages, and state management for the SajavatHub interior design platform.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like background, foreground, primary, secondary, borders, and charts.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (home, shop, designers, packages, quiz, dashboard, checkout, vendors, gift cards) wrapped in QueryClientProvider and ThemeProvider.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Empty file (no content provided).",
  "frontend/src/components/cart/AddToCartButton.tsx": "Reusable button component that adds products to cart with inventory validation, quantity clamping, and toast notifications for success/error states.",
  "frontend/src/components/dashboard/ConsultationRequestForm.tsx": "Form component for requesting design consultations with date/time picker, optional notes field, and submission handling with toast feedback.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper component rendering SiteHeader, main content area with children, and SiteFooter in a flex column structure.",
  "frontend/src/components/matching/RecommendedDesignerCard.tsx": "Card component displaying designer information with portfolio image, bio, style badges, and action buttons for viewing profile or selecting to work together.",
  "frontend/src/components/navigation/BackButton.tsx": "A reusable back button component that attempts browser history navigation first, falling back to a specified path if history is unavailable or fails.",
  "frontend/src/components/navigation/SiteFooter.tsx": "Site footer component displaying branding, social media links, navigation links organized by category (Services, Company, Locations), and copyright information.",
  "frontend/src/components/navigation/SiteHeader.tsx": "Main site header with responsive navigation, authentication controls (login/logout), shopping cart badge, and dropdown menus for designers and design packages.",
  "frontend/src/components/packages/PackagesInfoSections.tsx": "Informational sections explaining the design process workflow (4 steps) and what's included in design packages, using cards and icons for visual presentation.",
  "frontend/src/components/packages/room-packages/IncludedProductCard.tsx": "Card component displaying a single product within a room package, showing image, name, description, price, and stock status with consistent layout.",
  "frontend/src/components/packages/room-packages/IncludedProductsPanel.tsx": "Panel displaying a sortable grid of products included in a room package, with sorting controls and product count display.",
  "frontend/src/components/packages/room-packages/ProductsLoadingState.tsx": "Loading skeleton component that mimics the layout of the products grid with placeholder cards matching the actual product card structure.",
  "frontend/src/components/packages/room-packages/RoomPackageDetailHeader.tsx": "Displays detailed header for a room package with title, description, badges, price, quantity selector, and add-to-cart button. Calculates minimum inventory across all products in the package and clamps quantity accordingly.",
  "frontend/src/components/packages/room-packages/RoomPackageList.tsx": "Renders a responsive grid of room package cards using RoomPackageListItem components. Handles package selection and passes style/room type label formatters.",
  "frontend/src/components/packages/room-packages/RoomPackageListItem.tsx": "Displays a single room package card with name, style/room type badges, price, and description. Applies visual selection state and handles click events.",
  "frontend/src/components/packages/room-packages/RoomPackagesLoadingState.tsx": "Shows skeleton loading placeholders for room package cards in a grid layout during data fetching.",
  "frontend/src/components/packages/StylePackagesSection.tsx": "Main component for browsing room packages with style and room type filters, displaying package lists, detailed views, and bulk add-to-cart functionality.",
  "frontend/src/components/products/GlobalProductSearchPanel.tsx": "Provides a search interface for products with debounced input, displays search results in a grid using ProductListingCard, and shows loading/error/empty states.",
  "frontend/src/components/products/ProductListingCard.tsx": "Displays a product card with image, name, description, price, inventory badge, quantity selector, and add-to-cart button. Manages quantity state with inventory constraints.",
  "frontend/src/components/products/QuantitySelector.tsx": "Reusable quantity selector component with increment/decrement buttons, displays current quantity, and enforces min/max constraints.",
  "frontend/src/components/products/SafeExternalImage.tsx": "Image component with error handling that falls back to a default image if the external source fails to load. Resets state when src prop changes.",
  "frontend/src/components/vendors/VendorListItem.tsx": "Displays vendor information card showing name, GST number, mobile number, registration date, and verified badge with icons.",
  "frontend/src/components/vendors/VendorRegistrationCard.tsx": "Multi-step vendor registration form with details entry, OTP verification, and success states. Validates vendor name, mobile number, and GST format before requesting OTP.",
  "frontend/src/data/furnitureImageOverrides.ts": "Provides copyright-free Pexels image URLs for furniture subcategories and functions to retrieve or apply these images as overrides when product images are missing.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor with authentication, initializing it with the user's identity and admin token, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "React hook that fetches the current authenticated user's profile from the backend actor using React Query.",
  "frontend/src/hooks/useDebouncedValue.ts": "React hook that debounces a value by a specified delay (default 500ms) using setTimeout.",
  "frontend/src/hooks/useDesignerMatching.ts": "React hooks for fetching recommended designers filtered by room type and style preferences, and for selecting a designer for a project brief.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state and identity persistence using @dfinity/auth-client.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including packages, designers, project briefs, consultations, notes, user profiles, products, orders, vendors, and OTP operations.",
  "frontend/src/hooks/useUserRole.ts": "React hooks that fetch the caller's user role and admin status from the backend actor using React Query.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens defining a warm editorial color palette with terracotta accents for both light and dark modes, plus typography settings using Inter and Lora fonts.",
  "frontend/src/main.tsx": "Application entry point that renders the root App component wrapped in QueryClientProvider and InternetIdentityProvider for state management and authentication.",
  "frontend/src/pages/cart/CartPage.tsx": "Shopping cart page displaying product items and gift cards with quantity controls, removal options, and checkout navigation. Shows empty state with links to shop when cart is empty.",
  "frontend/src/pages/checkout/CheckoutPage.tsx": "Checkout page handling order placement with buyer information, delivery address forms, payment method selection (UPI/card/net banking), and validation. Prefills user profile data and supports both product orders and gift card purchases.",
  "frontend/src/pages/dashboard/DashboardPage.tsx": "User dashboard displaying project briefs with status badges and creation dates, plus a consultation request form. Shows empty state with call-to-action to start the style quiz when no projects exist.",
  "frontend/src/pages/DesignerDetailPage.tsx": "Displays detailed information about a specific designer including bio, styles, portfolio images, and CTAs to start a project or take the style quiz. Handles loading, error, and not-found states with skeleton loaders and alerts.",
  "frontend/src/pages/DesignersAndPackagesLandingPage.tsx": "Landing page with two card options linking to either the designers directory or design packages page. Simple grid layout with hero images and descriptions for each option.",
  "frontend/src/pages/DesignersPage.tsx": "Displays a filterable grid of all designers with search by name and filter by style functionality. Includes hero section and uses SafeExternalImage for designer portfolio images.",
  "frontend/src/pages/FaqPage.tsx": "FAQ page with accordion component displaying 8 common questions about SajavatHub services, pricing, timeline, deliverables, and process. Includes hero section with page title.",
  "frontend/src/pages/gift/GiftCardPage.tsx": "Gift card purchase page with preset and custom amounts, recipient/sender details, message input, and delivery scheduling (immediate or scheduled). Validates inputs and adds gift card to cart before navigating to checkout.",
  "frontend/src/pages/HomePage.tsx": "Main landing page with hero section, value proposition cards, featured designers/packages, how-it-works steps, and testimonials. Handles authenticated vs unauthenticated user flows with conditional CTAs.",
  "frontend/src/pages/HowItWorksPage.tsx": "Explains the 5-step design process (style quiz, choose package, get matched, collaborate, implement) with alternating text and icon cards. Includes hero section and final CTA to start the quiz.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 error page displaying a large 404 heading, error message, and button to return to the home page.",
  "frontend/src/pages/onboarding/DesignerMatchingPage.tsx": "Displays recommended designers based on user's room type and style preferences from onboarding quiz. Allows authenticated users to select a designer for their project brief and redirects to dashboard upon selection.",
  "frontend/src/pages/onboarding/OnboardingQuizPage.tsx": "Multi-step onboarding quiz (4 steps) collecting room type, style preferences, budget, and timeline. Captures optional designer ID from URL and stores responses in onboarding state before navigating to review page.",
  "frontend/src/pages/onboarding/ProjectBriefReviewPage.tsx": "Reviews and submits the project brief created from quiz responses. Requires authentication, validates quiz completion, creates brief via mutation, stores brief ID, and navigates to designer matching page.",
  "frontend/src/pages/PackagesPage.tsx": "Displays three interior design packages with pricing, features, and a call-to-action to start the design quiz. Includes loading states, error handling, and validation to ensure exactly three packages are available.",
  "frontend/src/pages/products/DecorLandingPage.tsx": "Landing page for the Decor category with hero section and 'Coming Soon' placeholder indicating the collection is being curated.",
  "frontend/src/pages/products/FurnishingLandingPage.tsx": "Landing page for the Furnishing category (curtains, rugs, cushions) with hero section and 'Coming Soon' placeholder.",
  "frontend/src/pages/products/FurnitureMenuPage.tsx": "Navigation page displaying 12 furniture subcategories (sofas, beds, tables, etc.) as clickable cards that link to individual subcategory product listing pages.",
  "frontend/src/pages/products/FurnitureSubCategoryPage.tsx": "Displays products filtered by furniture subcategory (sofas, beds, tables, etc.) with image overrides, loading states, and a grid layout using ProductListingCard components.",
  "frontend/src/pages/products/ProductBrandDetailPage.tsx": "Shows all products from a specific brand with brand information, handling loading/error states and displaying products in a grid using ProductListingCard.",
  "frontend/src/pages/products/ProductBrandsPage.tsx": "Lists all available product brands in a card grid with logos, descriptions, and links to individual brand detail pages.",
  "frontend/src/pages/products/ProductCategoriesPage.tsx": "Landing page displaying three main product categories (Furniture, Furnishing, Decor) with images and descriptions as clickable cards.",
  "frontend/src/pages/products/ProductCategoryDetailPage.tsx": "Shows all products within a specific category with loading/error handling and displays them in a grid using ProductListingCard.",
  "frontend/src/pages/products/RoomCategoryPage.tsx": "Displays complete room packages organized by style and room type, featuring the StylePackagesSection component for browsing curated collections.",
  "frontend/src/pages/products/ShopLandingPage.tsx": "Main shopping hub with global product search and three navigation options: Room Packages, Categories, and Brands, each presented as clickable cards.",
  "frontend/src/pages/projects/ProjectWorkspacePage.tsx": "Project workspace page showing project brief details, notes timeline, and functionality to add new notes with user identity integration and formatting utilities.",
  "frontend/src/pages/RoomVisualizerPage.tsx": "Provides a manual room visualization tool where users can upload a room photo, select furniture products from categories, and adjust product scale and position via drag-and-drop to preview how items look in their space.",
  "frontend/src/pages/vendors/VendorsPage.tsx": "Main vendors page component that displays a list of vendors with registration form toggle, loading states, and empty state handling using useGetAllVendors hook.",
  "frontend/src/routes/RequireAuth.tsx": "Authentication guard component that displays a sign-in card with Internet Identity login when user is not authenticated, otherwise renders children.",
  "frontend/src/state/cartStore.ts": "Zustand store for shopping cart state management with persistence, handling cart items, gift cards, quantity validation, and inventory checks.",
  "frontend/src/state/onboardingStore.ts": "Zustand store managing onboarding flow state including room type, style preferences, budget, timeline, package selection, and designer preselection.",
  "frontend/src/utils/format.ts": "Utility functions for formatting currency (INR), dates, and timestamps using Intl API with Indian locale.",
  "frontend/src/utils/locations.ts": "Utility that returns a list of Indian cities with Ahmedabad guaranteed as the first option, filtering duplicates while preserving order.",
  "frontend/src/utils/roomPackageSort.ts": "Utility for sorting Product arrays by name or price in ascending/descending order with predefined sort option configurations.",
  "frontend/src/utils/urlParams.ts": "Comprehensive URL parameter utilities for extracting, persisting, and clearing parameters from both regular query strings and hash-based routing with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extending colors (using OKLCH), typography, container settings, animations, and plugins for typography and container queries.",
  "project_state.json": "Project state metadata tracking architectural notes, features, and a pending request to remove tab navigation from Designers and Design Packages dropdown menu."
}