{
  "backend/main.mo": "Defines data models for rooms, styles, products, orders, users, and helper array utilities for the backend actor.",
  "feature_evidence.json": "Lists feature evidence records linking features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files for documentation or build reference.",
  "frontend/index.css": "Tailwind CSS base file defining theme tokens, dark mode variables, and global color system.",
  "frontend/index.html": "HTML entry point that loads the root React application via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for all major pages and wraps the app with layout, theming, and React Query providers.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting new authenticated users to enter basic profile info and saving it via backend mutation.",
  "frontend/src/components/cart/AddToCartButton.tsx": "Button component that adds a product to the cart, showing toast feedback and disabling when out of stock.",
  "frontend/src/components/dashboard/ConsultationRequestForm.tsx": "A form component that lets authenticated users request a consultation by submitting a date, notes, and generating a request ID, using a mutation hook.",
  "frontend/src/components/layout/SiteLayout.tsx": "Provides the main site layout with header, footer, and profile setup dialog surrounding page content.",
  "frontend/src/components/navigation/SiteFooter.tsx": "Renders the site footer with branding, links, social icons, and a dynamic locations list.",
  "frontend/src/components/navigation/SiteHeader.tsx": "Implements the site header with navigation links, category menu, authentication controls, and mobile menu support.",
  "frontend/src/components/packages/PackagesInfoSections.tsx": "Displays informational sections about the design process and what is included in service packages using styled cards.",
  "frontend/src/components/packages/room-packages/IncludedProductCard.tsx": "Shows a single included product with image, description, price, and stock status.",
  "frontend/src/components/packages/room-packages/IncludedProductsPanel.tsx": "Displays a sortable grid of included products using IncludedProductCard components.",
  "frontend/src/components/packages/room-packages/ProductsLoadingState.tsx": "Provides skeleton placeholders for the included products panel while data is loading.",
  "frontend/src/components/packages/room-packages/RoomPackageDetailHeader.tsx": "Displays a detailed header for a room package including name, description, labels, price, and an add-to-cart button.",
  "frontend/src/components/packages/room-packages/RoomPackageList.tsx": "Renders a grid of room packages and delegates item rendering to RoomPackageListItem with selection handling.",
  "frontend/src/components/packages/room-packages/RoomPackageListItem.tsx": "Clickable card showing a room package’s name, labels, price, and brief description with selection highlighting.",
  "frontend/src/components/packages/room-packages/RoomPackagesLoadingState.tsx": "Skeleton loader showing placeholder cards while room package data is loading.",
  "frontend/src/components/packages/StylePackagesSection.tsx": "Allows users to filter room packages by style and room type, view package details, and add all related products to the cart.",
  "frontend/src/components/products/SafeExternalImage.tsx": "Image wrapper that swaps to a fallback source if the external image fails to load.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the caller’s user profile using the backend actor and handles actor loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing identity loading, login, and logout states.",
  "frontend/src/hooks/useQueries.ts": "Collection of hooks for fetching and mutating backend resources like packages, designers, briefs, consultations, notes, and profiles.",
  "frontend/src/hooks/useUserRole.ts": "Hooks for retrieving the caller’s user role and admin status from the backend actor.",
  "frontend/src/index.css": "Defines Tailwind theme variables for light and dark modes with warm color palettes and base styling.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/cart/CartPage.tsx": "Shows cart items with quantity controls, subtotal calculation, and navigation to checkout or shopping pages.",
  "frontend/src/pages/checkout/CheckoutPage.tsx": "Handles order checkout with delivery address validation, payment method selection, and order placement.",
  "frontend/src/pages/dashboard/DashboardPage.tsx": "Displays a user dashboard with project briefs, status badges, and links to create or view design projects.",
  "frontend/src/pages/DesignerDetailPage.tsx": "Shows a detailed profile for a selected designer, including bio, styles, and portfolio with loading and not‑found states.",
  "frontend/src/pages/DesignersPage.tsx": "Lists designers with search and style filtering, displaying profiles in a card grid.",
  "frontend/src/pages/FaqPage.tsx": "Renders an FAQ list using an accordion with predefined questions and answers.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with hero content, feature highlights, and authentication‑aware onboarding navigation.",
  "frontend/src/pages/HowItWorksPage.tsx": "Explains the step‑by‑step design process with descriptive sections and feature lists.",
  "frontend/src/pages/NotFoundPage.tsx": "Shows a 404 message with a link to return to the home page.",
  "frontend/src/pages/onboarding/OnboardingQuizPage.tsx": "Multi-step onboarding quiz that collects room type, style preferences, budget, and timeline, updating onboarding store state and navigating to review.",
  "frontend/src/pages/onboarding/ProjectBriefReviewPage.tsx": "Displays a summary of collected onboarding data and submits a project brief to the backend after authentication.",
  "frontend/src/pages/PackagesPage.tsx": "Displays available design packages, highlights the most popular option, and lets users select a package to start onboarding.",
  "frontend/src/pages/products/ProductBrandDetailPage.tsx": "Loads and displays products for a specific brand with handling for loading, errors, missing brands, and empty product lists.",
  "frontend/src/pages/products/ProductBrandsPage.tsx": "Fetches and lists all product brands with loading, error, and empty-state handling, allowing navigation to brand detail pages.",
  "frontend/src/pages/products/ProductCategoriesPage.tsx": "Fetches and displays product categories sorted by hierarchy depth, with loading, error, and empty-state handling and category image selection logic.",
  "frontend/src/pages/products/ProductCategoryDetailPage.tsx": "Displays products for a given category, handling loading, errors, empty states, and product listing with add‑to‑cart support.",
  "frontend/src/pages/products/RoomCategoryPage.tsx": "Shows an introductory page for browsing room‑based style packages using the StylePackagesSection component.",
  "frontend/src/pages/products/ShopLandingPage.tsx": "Landing page offering navigation tiles to shop by room packages, product categories, or brands.",
  "frontend/src/pages/projects/ProjectWorkspacePage.tsx": "Workspace page for a project showing brief details, notes, and an interface to add new notes.",
  "frontend/src/pages/RoomVisualizerPage.tsx": "Provides a manual room visualization tool where users upload a room photo, select a product, and adjust its scale and position.",
  "frontend/src/routes/RequireAuth.tsx": "Auth guard that blocks access until the user is signed in, showing a sign‑in prompt if not authenticated.",
  "frontend/src/state/cartStore.ts": "Zustand store managing cart items with add, bulk add, remove, quantity updates, and subtotal and count helpers.",
  "frontend/src/state/onboardingStore.ts": "Zustand store for onboarding selections including room type, styles, budget, timeline, and chosen package.",
  "frontend/src/utils/format.ts": "Provides INR currency formatting and timestamp formatting utilities for dates and date‑times.",
  "frontend/src/utils/locations.ts": "Generates a location list with Ahmedabad always appearing first while preserving order of others.",
  "frontend/src/utils/roomPackageSort.ts": "Defines sort options and a function to sort products by name or price in ascending or descending order.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash routing), persisting them in sessionStorage, and clearing them from the URL or storage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Metadata describing the project state, existing features, pending requests, and overall project configuration."
}