{
  "backend/main.mo": "Defines numerous types for rooms, styles, products, orders, users, and project workflows, forming the backend data model. Includes a utility module and authorization imports but is truncated before logic.",
  "feature_evidence.json": "Contains feature evidence metadata mapping features to related frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for many frontend files describing routing, components, hooks, and UI features.",
  "frontend/index.css": "Global Tailwind CSS configuration defining theme variables and base styling for light and dark modes.",
  "frontend/index.html": "Root HTML file that loads the React app via main.tsx into the #root container.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, shared layout, protected routes, and React Query client.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting new authenticated users to complete their profile, handling form state and saveProfile mutations.",
  "frontend/src/components/cart/AddToCartButton.tsx": "Button component that adds a product to the cart with quantity validation and toast notifications.",
  "frontend/src/components/dashboard/ConsultationRequestForm.tsx": "Form for submitting consultation requests, validating identity and date before sending a mutation and showing toast messages.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper that renders a header, footer, and main content area.",
  "frontend/src/components/navigation/BackButton.tsx": "Back button that navigates browser history or falls back to a specified route.",
  "frontend/src/components/navigation/SiteFooter.tsx": "Footer displaying branding, social links, navigation links, and ordered locations.",
  "frontend/src/components/navigation/SiteHeader.tsx": "Sticky header with navigation links, category dropdown, cart count, and authentication handling.",
  "frontend/src/components/packages/PackagesInfoSections.tsx": "Sections explaining the design process and listing features included in all packages.",
  "frontend/src/components/packages/room-packages/IncludedProductCard.tsx": "Card component showing product image, details, price, and stock status for included package items.",
  "frontend/src/components/packages/room-packages/IncludedProductsPanel.tsx": "Renders sortable list of included products with a select control and product cards.",
  "frontend/src/components/packages/room-packages/ProductsLoadingState.tsx": "Displays skeleton placeholders for product list while loading.",
  "frontend/src/components/packages/room-packages/RoomPackageDetailHeader.tsx": "Shows package header with details, inventory-based quantity selector, and add-to-cart handling.",
  "frontend/src/components/packages/room-packages/RoomPackageList.tsx": "Lists room packages and highlights the selected one for navigation.",
  "frontend/src/components/packages/room-packages/RoomPackageListItem.tsx": "Displays a room package summary card with style, room type, price, and selection state.",
  "frontend/src/components/packages/room-packages/RoomPackagesLoadingState.tsx": "Shows skeleton loaders for room package cards during fetch.",
  "frontend/src/components/packages/StylePackagesSection.tsx": "UI for selecting style and room type, viewing matching room packages, and adding package products to the cart.",
  "frontend/src/components/products/GlobalProductSearchPanel.tsx": "Provides debounced global product search with loading, error, and result states.",
  "frontend/src/components/products/ProductListingCard.tsx": "Product card with image, price, stock badge, quantity selector, and add-to-cart button.",
  "frontend/src/components/products/QuantitySelector.tsx": "Simple increment/decrement quantity control with bounds checking.",
  "frontend/src/components/products/SafeExternalImage.tsx": "Image component that swaps to a fallback image on load error.",
  "frontend/src/components/vendors/VendorListItem.tsx": "Vendor card showing name, verification status, GST, contact, and registration date.",
  "frontend/src/components/vendors/VendorRegistrationCard.tsx": "React component managing vendor registration with field validation, OTP flow, and API mutations.",
  "frontend/src/data/furnitureImageOverrides.ts": "Provides copyright‑free image URLs for furniture subcategories and utilities to override missing product images.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s Internet Identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the currently authenticated user's profile via the actor with loading state tied to identity readiness.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value after a configurable delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity state, login, logout, and related status flags.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations like fetching packages, projects, notes, and vendor OTP workflows.",
  "frontend/src/hooks/useUserRole.ts": "Hooks to fetch the caller’s user role and admin status from the backend actor.",
  "frontend/src/index.css": "Tailwind base stylesheet defining light and dark theme color variables and global styles.",
  "frontend/src/main.tsx": "Application entry point initializing React, Internet Identity provider, and React Query client.",
  "frontend/src/pages/cart/CartPage.tsx": "Renders the shopping cart with quantity controls, item removal, subtotal calculation, and checkout navigation.",
  "frontend/src/pages/checkout/CheckoutPage.tsx": "Handles checkout flow including buyer info, delivery address, payment selection, validation, and order placement.",
  "frontend/src/pages/dashboard/DashboardPage.tsx": "Shows user design projects with loading and error states, allowing project viewing or starting a new one if none exist.",
  "frontend/src/pages/DesignerDetailPage.tsx": "Shows a detailed view of a selected designer, handling loading/error states and displaying bio, styles, and portfolio.",
  "frontend/src/pages/DesignersPage.tsx": "Lists designers with search and style filters, rendering cards for each and loading indicators when fetching data.",
  "frontend/src/pages/FaqPage.tsx": "Displays a list of FAQ items using an accordion layout.",
  "frontend/src/pages/HomePage.tsx": "Home landing page with hero, features, and navigation actions based on authentication state.",
  "frontend/src/pages/HowItWorksPage.tsx": "Explains the service process through a series of steps with descriptive text and icons.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page with message and link back to home.",
  "frontend/src/pages/onboarding/OnboardingQuizPage.tsx": "Interactive multi-step onboarding quiz collecting room type, style preferences, budget, and timeline with navigation and progress tracking.",
  "frontend/src/pages/onboarding/ProjectBriefReviewPage.tsx": "Displays a review of collected onboarding data and submits a project brief, handling authentication, validation, and submission states.",
  "frontend/src/pages/PackagesPage.tsx": "Displays design packages with loading and error states, showing package cards with features and pricing.",
  "frontend/src/pages/products/DecorLandingPage.tsx": "Simple landing page for decor products with a header and a coming-soon message.",
  "frontend/src/pages/products/FurnishingLandingPage.tsx": "Landing page for furnishing products featuring a themed header and coming-soon notice.",
  "frontend/src/pages/products/FurnitureMenuPage.tsx": "Shows a grid of furniture subcategories linking to detailed product listings.",
  "frontend/src/pages/products/FurnitureSubCategoryPage.tsx": "Fetches and displays products for a specific furniture subcategory with loading, error, and empty states.",
  "frontend/src/pages/products/ProductBrandDetailPage.tsx": "Displays products for a selected brand with full loading, error, and not-found handling.",
  "frontend/src/pages/products/ProductBrandsPage.tsx": "Lists all product brands with loading and error states, linking to brand detail pages.",
  "frontend/src/pages/products/ProductCategoriesPage.tsx": "Displays three product categories with images and links for furniture, furnishing, and decor.",
  "frontend/src/pages/products/ProductCategoryDetailPage.tsx": "Fetches and shows products for a selected category with loading, error, and empty states.",
  "frontend/src/pages/products/RoomCategoryPage.tsx": "Shows room-based style package listings with a back button and intro text.",
  "frontend/src/pages/products/ShopLandingPage.tsx": "Landing page offering global product search and links to room packages, categories, and brands.",
  "frontend/src/pages/projects/ProjectWorkspacePage.tsx": "Loads project details and notes, allows adding notes, and shows project status and information.",
  "frontend/src/pages/RoomVisualizerPage.tsx": "Provides a manual room visualizer where users upload a room photo, select products, and adjust placement and scale.",
  "frontend/src/pages/vendors/VendorsPage.tsx": "Manages vendor registration, displays vendors, and handles loading and error states.",
  "frontend/src/routes/RequireAuth.tsx": "Gatekeeper component that prompts users to sign in with Internet Identity before accessing protected content.",
  "frontend/src/state/cartStore.ts": "Zustand store managing cart items with add, bulk-add, remove, quantity update, and subtotal functions.",
  "frontend/src/state/onboardingStore.ts": "Zustand store managing onboarding fields like room type, styles, budget, timeline, and selected package with setters and reset.",
  "frontend/src/utils/format.ts": "Provides INR currency formatting and timestamp-to-date or datetime formatting utilities.",
  "frontend/src/utils/locations.ts": "Generates a location list ensuring Ahmedabad appears first without duplicates.",
  "frontend/src/utils/roomPackageSort.ts": "Defines sort options and a function to sort products by name or price in ascending or descending order.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based query values.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending themes, colors, fonts, animations, and enabling typography and container query plugins.",
  "project_state.json": "Tracks project metadata, feature states, and pending vendor registration feature requests."
}