{
  "backend/main.mo": "Defines the actor’s core data model for rooms, styles, products, orders, projects, and utilities, including array helpers and type structures for the backend.",
  "backend/migration.mo": "Contains legacy type definitions and migration logic for transforming old stored data into the new backend schema, including product and furniture structures.",
  "feature_evidence.json": "Lists features, related code files, components, and test IDs used for tracking implementation evidence of product search and furniture navigation features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend React components, hooks, pages, and utilities.",
  "frontend/index.css": "Tailwind CSS base file defining design tokens, light/dark theme variables, and global styles.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and QueryClient, defining all main pages including shop, products, dashboard, and furniture subcategory routes within the SiteLayout.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Displays a dialog for new authenticated users to enter and save basic profile details using form inputs and mutation hooks.",
  "frontend/src/components/cart/AddToCartButton.tsx": "Provides a button to add a product to the cart with inventory checks and toast feedback.",
  "frontend/src/components/dashboard/ConsultationRequestForm.tsx": "Form allowing authenticated users to request a consultation by submitting a date, notes, and generated request metadata.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper including header, footer, and the profile setup dialog around page content.",
  "frontend/src/components/navigation/SiteFooter.tsx": "Renders the footer with branding, social links, service links, and dynamically listed locations.",
  "frontend/src/components/navigation/SiteHeader.tsx": "Renders the site header with navigation, category dropdown, authentication controls, and cart count integration.",
  "frontend/src/components/packages/PackagesInfoSections.tsx": "Displays informational sections describing the design process and package inclusions using cards and icons.",
  "frontend/src/components/packages/room-packages/IncludedProductCard.tsx": "Displays a product within a package with image, name, description, price, and stock badge.",
  "frontend/src/components/packages/room-packages/IncludedProductsPanel.tsx": "Shows sortable included products grid and renders product cards based on selected sort option.",
  "frontend/src/components/packages/room-packages/ProductsLoadingState.tsx": "Skeleton UI representing loading state for included products.",
  "frontend/src/components/packages/room-packages/RoomPackageDetailHeader.tsx": "Displays selected room package details, price, labels, and an add-to-cart button.",
  "frontend/src/components/packages/room-packages/RoomPackageList.tsx": "Renders a grid of room package list items and handles selection state.",
  "frontend/src/components/packages/room-packages/RoomPackageListItem.tsx": "Card UI for an individual room package with style, room type, description, and selectable highlighting.",
  "frontend/src/components/packages/room-packages/RoomPackagesLoadingState.tsx": "Skeleton loading UI for the room package list.",
  "frontend/src/components/packages/StylePackagesSection.tsx": "Manages style and room-type filters, loads matching room packages and products, and handles selecting and adding a full package to cart.",
  "frontend/src/components/products/GlobalProductSearchPanel.tsx": "Provides global product search with debounced query, results grid, and loading/error states.",
  "frontend/src/components/products/ProductListingCard.tsx": "Displays a product with image, details, stock indicator, price, and add-to-cart button.",
  "frontend/src/components/products/SafeExternalImage.tsx": "Image component that swaps to a fallback source if the main image fails to load.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the caller’s user profile using the current actor and exposes loading state.",
  "frontend/src/hooks/useDebouncedValue.ts": "Provides a hook that returns a debounced version of a value using a timeout.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and provider for Internet Identity authentication, exposing identity state and login/logout methods.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as designers, packages, briefs, notes, and consultations.",
  "frontend/src/hooks/useUserRole.ts": "Provides hooks to fetch the caller's user role and admin status via the actor API.",
  "frontend/src/index.css": "Tailwind CSS setup with custom light and dark theme variables and base styling.",
  "frontend/src/main.tsx": "Bootstraps the app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/cart/CartPage.tsx": "Renders the shopping cart with item listing, quantity controls, subtotal, and checkout navigation, including an empty-state view.",
  "frontend/src/pages/checkout/CheckoutPage.tsx": "Handles order checkout with delivery address validation, payment selection, order placement, and user authentication checks.",
  "frontend/src/pages/dashboard/DashboardPage.tsx": "Displays the user's project briefs with loading/error states and allows navigation to start new design projects.",
  "frontend/src/pages/DesignerDetailPage.tsx": "Displays detailed information for a single designer, including bio, styles, and portfolio with loading and error states.",
  "frontend/src/pages/DesignersPage.tsx": "Lists designers with search and style filtering, using designer data from the backend.",
  "frontend/src/pages/FaqPage.tsx": "Displays a FAQ page with an accordion listing predefined questions and answers about the service.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, feature highlights, and navigation actions depending on authentication state.",
  "frontend/src/pages/HowItWorksPage.tsx": "Shows a step-by-step overview of the design process with descriptive sections and icons.",
  "frontend/src/pages/NotFoundPage.tsx": "Provides a simple 404 page with a message and a button to return home.",
  "frontend/src/pages/onboarding/OnboardingQuizPage.tsx": "Implements a multi-step onboarding quiz for selecting room type, styles, budget, and timeline before creating a project brief.",
  "frontend/src/pages/onboarding/ProjectBriefReviewPage.tsx": "Shows a review of the user's quiz selections and handles submission of a new project brief with authentication and status feedback.",
  "frontend/src/pages/PackagesPage.tsx": "Fetches and displays design packages, handling loading and error states, with a hero and detailed package cards.",
  "frontend/src/pages/products/FurnitureSubCategoryPage.tsx": "Fetches and displays products for a given furniture subcategory with loading, error, and empty-state handling.",
  "frontend/src/pages/products/ProductBrandDetailPage.tsx": "Displays products for a selected brand, handling loading, errors, missing brands, and empty product lists with UI states.",
  "frontend/src/pages/products/ProductBrandsPage.tsx": "Lists all product brands with loading and error handling, linking each brand to its detail page.",
  "frontend/src/pages/products/ProductCategoriesPage.tsx": "Fetches and displays product categories with sorted ordering, fallback images, and full loading/error states.",
  "frontend/src/pages/products/ProductCategoryDetailPage.tsx": "Shows all products within a specific category, including loading, error, and empty-category messaging.",
  "frontend/src/pages/products/RoomCategoryPage.tsx": "Renders a landing page for browsing room-based product packages via the StylePackagesSection component.",
  "frontend/src/pages/products/ShopLandingPage.tsx": "Provides the main shop landing page with product search and tiles linking to room packages, categories, and brands.",
  "frontend/src/pages/projects/ProjectWorkspacePage.tsx": "Displays project details and notes, allows adding notes, and handles loading, errors, and identity-based note submission.",
  "frontend/src/pages/RoomVisualizerPage.tsx": "Implements a manual room visualizer allowing users to upload a room photo, select products, and position/scale them on a preview canvas.",
  "frontend/src/routes/RequireAuth.tsx": "A wrapper route component that checks Internet Identity state and either shows loading, a sign-in prompt, or the protected children.",
  "frontend/src/state/cartStore.ts": "Zustand store managing cart items with add, bulk add, remove, quantity update, clear, subtotal, and item count logic, persisted to storage.",
  "frontend/src/state/onboardingStore.ts": "Zustand store for onboarding data including room type, styles, budget, timeline, and selected package with setters and reset.",
  "frontend/src/utils/format.ts": "Utility functions for formatting INR currency and converting bigint timestamps to date or datetime strings.",
  "frontend/src/utils/locations.ts": "Returns a predefined location list with Ahmedabad forced to the first position without duplication.",
  "frontend/src/utils/roomPackageSort.ts": "Defines sort options and a function to sort products by name or price in ascending or descending order.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing URL or hash-based query values.",
  "frontend/tailwind.config.js": "Tailwind config defining theme extensions, colors, typography, animations, and plugins.",
  "project_state.json": "Project state describing existing and requested features related to global product search and furniture category expansion."
}