{
  "backend/main.mo": "Defines the main canister actor with data models, in‑memory maps, authorization mixin, and CRUD-style functions for packages, designers, briefs, consultations, notes, user profiles, and product categories.",
  "backend/migration.mo": "Implements the upgrade migration function that preserves existing state and seeds new product categories with predefined sample products.",
  "feature_evidence.json": "Feature evidence report listing files, components, and tests related to resilient external product image handling.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing the purpose of each frontend source file.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, dark mode overrides, and base styling.",
  "frontend/index.html": "Base HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures the React app, router, providers, and top-level routes including product browsing pages.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog that prompts authenticated users without a profile to create one and submits it to the backend.",
  "frontend/src/components/dashboard/ConsultationRequestForm.tsx": "Form component allowing authenticated users to submit consultation requests using a mutation hook.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper that renders the site header, footer, profile setup dialog, and page content.",
  "frontend/src/components/navigation/SiteFooter.tsx": "Footer displaying brand info, navigation links, social icons, and a dynamic copyright note.",
  "frontend/src/components/navigation/SiteHeader.tsx": "Responsive header with navigation links, authentication controls, and a mobile menu using Internet Identity.",
  "frontend/src/components/products/SafeExternalImage.tsx": "Image component that swaps to a fallback image if the external source fails to load.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hook fetching the current user's profile once the actor is ready.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login, logout, stored identity, and auth state.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks for fetching and mutating backend data such as packages, designers, briefs, consultations, notes, and profiles.",
  "frontend/src/hooks/useUserRole.ts": "Hooks for retrieving the caller's user role and admin status from the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light and dark theme CSS variables with global base styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/dashboard/DashboardPage.tsx": "Loads and displays the user's project briefs with statuses and navigation to create new projects or view details.",
  "frontend/src/pages/DesignerDetailPage.tsx": "Displays detailed info for a selected designer, including bio, styles, and portfolio images with loading and not-found states.",
  "frontend/src/pages/DesignersPage.tsx": "Shows a searchable and filterable list of designers using name and style filters with data loaded from a query hook.",
  "frontend/src/pages/FaqPage.tsx": "Renders a FAQ section using accordion components with predefined questions and answers.",
  "frontend/src/pages/HomePage.tsx": "Home landing page featuring hero, features, and calls to action, with navigation based on authentication.",
  "frontend/src/pages/HowItWorksPage.tsx": "Explains the platform’s 5‑step process using structured sections with descriptions and feature lists.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page displaying an error message and a button to return home.",
  "frontend/src/pages/onboarding/OnboardingQuizPage.tsx": "Implements a four‑step onboarding quiz to collect room type, style preferences, budget, and timeline, persisting answers to state.",
  "frontend/src/pages/onboarding/ProjectBriefReviewPage.tsx": "Shows a review of onboarding selections and submits a project brief to the backend, handling authentication and success state.",
  "frontend/src/pages/PackagesPage.tsx": "Fetches and displays design packages in a grid with pricing, features, and a selection action that stores the chosen package.",
  "frontend/src/pages/products/ProductCategoriesPage.tsx": "Fetches and displays product categories with loading, error, and empty states, including image selection logic based on category data.",
  "frontend/src/pages/products/ProductCategoryDetailPage.tsx": "Displays products for a selected category, handling loading, errors, and empty states, and renders a product grid once data loads.",
  "frontend/src/pages/projects/ProjectWorkspacePage.tsx": "Shows a detailed project workspace with brief info and notes, allowing authenticated users to add new notes.",
  "frontend/src/routes/RequireAuth.tsx": "A wrapper that blocks access until Internet Identity authentication is complete, showing a sign‑in prompt if unauthenticated.",
  "frontend/src/state/onboardingStore.ts": "Zustand store managing onboarding selections such as room type, styles, budget, timeline, and chosen package.",
  "frontend/src/utils/format.ts": "Formatting helpers for INR currency and timestamps into readable date and datetime strings.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending typography, colors, animations, and container settings for the frontend.",
  "project_state.json": "Project state file describing the sajavathub.com build plan, features, known issues, and architectural notes."
}