{
  "backend/main.mo": "Defines the main actor and all core domain types for rooms, styles, users, projects, products, orders, and utility structures.",
  "backend/migration.mo": "Provides a migration module initializing vendor, OTP, and verified OTP maps for backend state setup.",
  "feature_evidence.json": "Lists feature evidence for vendor-related frontend additions, including files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files and their roles in the application.",
  "frontend/index.css": "Defines Tailwind CSS layers and custom theme variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up the React Router, QueryClient, layout, and all application routes including the new Vendors route.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for creating a new user profile on first login with form validation and backend mutation.",
  "frontend/src/components/cart/AddToCartButton.tsx": "Button component that adds a product to the cart with inventory checks and toast notifications.",
  "frontend/src/components/dashboard/ConsultationRequestForm.tsx": "A form for submitting consultation requests, validating input and sending data via a mutation hook.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main site layout with header, footer, and a content area.",
  "frontend/src/components/navigation/BackButton.tsx": "A back button that uses browser history when available or falls back to a provided path.",
  "frontend/src/components/navigation/SiteFooter.tsx": "Renders the site footer with branding, links, social icons, and ordered location listings.",
  "frontend/src/components/navigation/SiteHeader.tsx": "Renders the main site header with navigation, authentication controls, cart count, and mobile menu handling.",
  "frontend/src/components/packages/PackagesInfoSections.tsx": "Displays informational sections about the design process and what’s included in design packages.",
  "frontend/src/components/packages/room-packages/IncludedProductCard.tsx": "Shows a product card with image, description, price, and stock status for included package items.",
  "frontend/src/components/packages/room-packages/IncludedProductsPanel.tsx": "Displays included products for a room package with sorting controls and renders product cards in a grid.",
  "frontend/src/components/packages/room-packages/ProductsLoadingState.tsx": "Shows skeleton loaders representing the product grid and header while data is loading.",
  "frontend/src/components/packages/room-packages/RoomPackageDetailHeader.tsx": "Renders package details, pricing, inventory‑based quantity selection, and an add‑to‑cart button with back navigation.",
  "frontend/src/components/packages/room-packages/RoomPackageList.tsx": "Lists room packages in a grid and highlights the selected package.",
  "frontend/src/components/packages/room-packages/RoomPackageListItem.tsx": "Displays a single room package with style, room type, price, and description, supporting selection highlighting.",
  "frontend/src/components/packages/room-packages/RoomPackagesLoadingState.tsx": "Shows skeleton placeholders for a loading room package list and header.",
  "frontend/src/components/packages/StylePackagesSection.tsx": "Allows users to filter room packages by style and room type, view details, and add full packages to the cart.",
  "frontend/src/components/products/GlobalProductSearchPanel.tsx": "Provides debounced global product search with loading, error, empty states, and result listing.",
  "frontend/src/components/products/ProductListingCard.tsx": "Displays a product with image, price, stock badge, quantity selector, and add‑to‑cart support.",
  "frontend/src/components/products/QuantitySelector.tsx": "Simple increment/decrement quantity control with max bounds and disabled handling.",
  "frontend/src/components/products/SafeExternalImage.tsx": "Image component that swaps to a fallback source when the main image fails to load.",
  "frontend/src/components/vendors/VendorRegistrationCard.tsx": "Multi‑step vendor registration flow including details entry, OTP verification, and success state.",
  "frontend/src/data/furnitureImageOverrides.ts": "Maps furniture subcategories to Pexels image URLs and provides utilities to apply default images to products with missing URLs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing queries when the actor changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the current caller's user profile using the active backend actor.",
  "frontend/src/hooks/useDebouncedValue.ts": "Provides a hook that returns a debounced version of a given value.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines multiple React Query hooks for backend operations like packages, designers, project briefs, notes, and consultations.",
  "frontend/src/hooks/useUserRole.ts": "Provides hooks to fetch the caller's user role and admin status from the backend.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/cart/CartPage.tsx": "Displays cart contents with quantity controls, item removal, subtotal calculation, and checkout navigation. Shows an empty‑cart state and uses store actions for updates.",
  "frontend/src/pages/checkout/CheckoutPage.tsx": "Implements the checkout flow including buyer info, delivery address, validation, payment selection, and order placement. Prefills user data and triggers place‑order mutation.",
  "frontend/src/pages/dashboard/DashboardPage.tsx": "Loads and displays a user's design project briefs with error/loading states and a prompt to start a new project if none exist. Shows project list with basic metadata and status badges.",
  "frontend/src/pages/DesignerDetailPage.tsx": "Displays detailed designer info including bio, styles, and portfolio with loading and error states.",
  "frontend/src/pages/DesignersPage.tsx": "Lists designers with search and style filtering, fetching data via useGetDesigners and rendering cards for each designer.",
  "frontend/src/pages/FaqPage.tsx": "Displays a structured FAQ list using an accordion component with predefined questions and answers.",
  "frontend/src/pages/HomePage.tsx": "Home landing page with hero, features, and authentication-based navigation to quiz or dashboard.",
  "frontend/src/pages/HowItWorksPage.tsx": "Explains the service workflow in a five-step layout with icons, descriptions, and visual cards.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page with a message and a button linking back to the home page.",
  "frontend/src/pages/onboarding/OnboardingQuizPage.tsx": "Runs a four‑step onboarding quiz collecting room type, style preferences, budget, and timeline. Manages step navigation, validation, and persists answers to onboarding store.",
  "frontend/src/pages/onboarding/ProjectBriefReviewPage.tsx": "Handles review and submission of a project brief, including auth checks, validation, and async brief creation.",
  "frontend/src/pages/PackagesPage.tsx": "Fetches and displays design packages with pricing, features, loading and error states, plus related info sections.",
  "frontend/src/pages/products/DecorLandingPage.tsx": "Displays a decor landing page with hero text and a coming‑soon message.",
  "frontend/src/pages/products/FurnishingLandingPage.tsx": "Shows a furnishing category landing page with descriptive hero section and coming‑soon notice.",
  "frontend/src/pages/products/FurnitureMenuPage.tsx": "Lists furniture subcategories with links and a hero image for browsing furniture products.",
  "frontend/src/pages/products/FurnitureSubCategoryPage.tsx": "Fetches and displays products for a specific furniture subcategory, handling loading, errors, and empty states.",
  "frontend/src/pages/products/ProductBrandDetailPage.tsx": "Displays products for a specific brand with loading, error, and no‑products handling.",
  "frontend/src/pages/products/ProductBrandsPage.tsx": "Shows a list of brands with loading and error states and links to individual brand detail pages.",
  "frontend/src/pages/products/ProductCategoriesPage.tsx": "Displays three product category tiles linking to furniture, furnishing, and decor pages with images and CTA buttons.",
  "frontend/src/pages/products/ProductCategoryDetailPage.tsx": "Fetches and displays products for a selected category with loading, error, and empty states.",
  "frontend/src/pages/products/RoomCategoryPage.tsx": "Shows room-based package browsing with a header and renders the StylePackagesSection component.",
  "frontend/src/pages/products/ShopLandingPage.tsx": "Landing page for the shop with search and navigation tiles for room packages, product categories, and brands.",
  "frontend/src/pages/projects/ProjectWorkspacePage.tsx": "Displays project details, notes, and allows adding notes with loading and error handling.",
  "frontend/src/pages/RoomVisualizerPage.tsx": "Provides a manual room visualizer allowing users to upload a room image, pick a product, and drag/scale it on a preview canvas. Handles image upload, product selection, position/scale adjustments, and reset.",
  "frontend/src/pages/vendors/VendorsPage.tsx": "Lists vendors, handles loading and errors, and provides vendor registration UI.",
  "frontend/src/routes/RequireAuth.tsx": "Wrapper enforcing authentication, showing login prompt or loading state before rendering children.",
  "frontend/src/state/cartStore.ts": "Zustand store managing cart items with add, bulk-add, remove, quantity updates, totals, and persistence.",
  "frontend/src/state/onboardingStore.ts": "Zustand store for onboarding data including room type, styles, budget, timeline, and selected package.",
  "frontend/src/utils/format.ts": "Formatting helpers for INR currency and timestamps into date and datetime strings.",
  "frontend/src/utils/locations.ts": "Ensures Ahmedabad is always the first item in a predefined location list.",
  "frontend/src/utils/roomPackageSort.ts": "Provides sort options and a utility to sort products by name or price in ascending or descending order.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and persisting URL parameters, including sessionStorage helpers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, fonts, animations, plugins, and container settings.",
  "project_state.json": "Project state describing vendor-feature requirements, existing features, and pending feature requests."
}