{
  "backend/main.mo": "Defines the backend actor with data types, storage maps, authorization mixin, and CRUD-style functions for packages, designers, briefs, consultations, notes, user profiles, and product categories.",
  "backend/migration.mo": "Provides migration logic that adds a new productCategories map to existing actor state, copying forward all other stored fields.",
  "feature_evidence.json": "Describes implemented features, affected frontend files, components used, and linked requirements for product category browsing and related navigation.",
  "frontend-file-summaries.txt": "Lists prewritten summaries for many frontend files including routing, components, pages, hooks, and utilities.",
  "frontend/index.css": "Tailwind CSS setup defining design tokens, light/dark theme variables, and base styling rules.",
  "frontend/index.html": "HTML entry point that initializes the app root and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, global providers, and page components including product category listing and detail pages.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog that prompts authenticated users without a profile to enter basic details and saves the profile via a mutation.",
  "frontend/src/components/dashboard/ConsultationRequestForm.tsx": "Form allowing logged‑in users to submit a consultation request with date, notes, and generated request metadata.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper including header, footer, and the profile setup dialog.",
  "frontend/src/components/navigation/SiteFooter.tsx": "Footer displaying branding, navigation links, social icons, locations, and a dynamic copyright.",
  "frontend/src/components/navigation/SiteHeader.tsx": "Header with navigation links, authentication controls, and a responsive mobile menu.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user's identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hook to fetch the current user's profile using the actor, exposing loading and fetched state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hook for handling Internet Identity auth flow, storing identity, and managing login state.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating backend data such as packages, designers, project briefs, consultations, notes, and user profiles using an actor instance.",
  "frontend/src/hooks/useUserRole.ts": "Defines React Query hooks to fetch the caller's user role and admin status from the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind base styles and defines light and dark theme CSS variables for colors, borders, and UI elements.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders the App component.",
  "frontend/src/pages/dashboard/DashboardPage.tsx": "Loads and displays the user’s project briefs with status and links to details, plus an option to start a new project.",
  "frontend/src/pages/DesignerDetailPage.tsx": "Displays detailed information for a selected designer, including bio, styles, and portfolio images, with loading and not-found states.",
  "frontend/src/pages/DesignersPage.tsx": "Shows a searchable and filterable list of designers using style and text filters with data loaded from useGetDesigners().",
  "frontend/src/pages/FaqPage.tsx": "Renders a FAQ page with an accordion listing common questions and answers about the service.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with hero content, feature highlights, and navigation actions based on Internet Identity authentication.",
  "frontend/src/pages/HowItWorksPage.tsx": "Renders a multi-step explanation of the platform’s design process using static content and stylized sections.",
  "frontend/src/pages/NotFoundPage.tsx": "Displays a 404 error page with a message and a button linking back to the home page.",
  "frontend/src/pages/onboarding/OnboardingQuizPage.tsx": "Implements a four-step onboarding quiz for room type, styles, budget, and timeline, saving answers to state and navigating to review.",
  "frontend/src/pages/onboarding/ProjectBriefReviewPage.tsx": "Shows a review of collected onboarding data and submits a project brief, handling authentication and success confirmation.",
  "frontend/src/pages/PackagesPage.tsx": "Fetches and displays design packages with pricing and features, allowing users to select a package and continue onboarding.",
  "frontend/src/pages/products/ProductCategoriesPage.tsx": "Fetches and displays product categories with loading, error, empty, and success states, including category sorting and image selection logic.",
  "frontend/src/pages/products/ProductCategoryDetailPage.tsx": "Loads a specific category and its products, handling loading, errors, missing categories, and rendering a product grid.",
  "frontend/src/pages/projects/ProjectWorkspacePage.tsx": "Displays a project workspace showing brief and notes, with ability to add notes and handle loading or missing-project states.",
  "frontend/src/routes/RequireAuth.tsx": "Guards routes by checking authentication and showing a sign‑in prompt or loading state if not authenticated.",
  "frontend/src/state/onboardingStore.ts": "Zustand store managing onboarding selections like room type, styles, budget, timeline, and selected package.",
  "frontend/src/utils/format.ts": "Utility functions for formatting INR currency and converting bigint timestamps into readable dates or date‑times.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hashes, and session storage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Defines the project’s current state, required images, and a list of implemented features for building the Indian interior‑design site sajavathub.com. Primarily serves as a versioned specification and progress record."
}