{
  "kind": "build_request",
  "title": "Improve Room Package browsing UI (Package Products by Room) and restructure how room packages/products are displayed",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the \"Package Products by Room\" browsing experience (frontend) so users can view and choose among multiple room packages returned for the selected style + room type instead of automatically using the first package only.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "After selecting a Design Style and Room Type, the UI shows a list/grid of matching room packages (not just a single package).",
        "Selecting a package in the list updates the package detail panel and the included products list for the selected package.",
        "If zero packages match, the existing empty state remains visible and no package detail panel is shown."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Restructure the room package detail presentation to make package information and actions clearer: show package name, description, style badge, room-type badge, package price, and a primary \"Add Entire Package to Cart\" action in a consistent layout that works on mobile and desktop.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "For a selected room package, the detail header consistently displays: name, description, style label, room type label, and formatted INR price.",
        "The \"Add Entire Package to Cart\" button remains disabled when the included products list is empty and shows the existing toast error messaging when appropriate.",
        "Layout is responsive: on small screens content stacks vertically; on larger screens it uses a clear two-column or well-spaced layout without overlapping elements."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve how included products within a room package are displayed: add a clearer product card layout with image, name, price, and stock status, and provide basic organization controls (at minimum: a sort control for price/name, and a count summary like \"X items included\").",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "When products are loaded for a selected package, the UI shows an item count summary (e.g., \"Included Products (3)\").",
        "A sort control is available that can reorder the displayed products by at least one of: price (low→high/high→low) and name (A→Z/Z→A).",
        "Each product card displays: image, product name, formatted INR price, and an in-stock/out-of-stock indicator (reusing existing inventory logic)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure the \"Package Products by Room\" page (route `/products/room-category`) has coherent loading/empty states for both the package list and the included products panel so users always understand what is loading vs. what is unavailable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "When packages are loading, a package-loading state is shown; when products are loading for a selected package, a products-loading state is shown independently.",
        "If packages are available but a selected package has zero resolved products, show a clear empty message for products (do not show a blank grid).",
        "No console errors occur when switching style/room selections rapidly (UI should handle state transitions without rendering with invalid IDs)."
      ]
    }
  ],
  "constraints": [
    "Do not change the existing route path `/products/room-category`.",
    "Do not edit any files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or anything under `frontend/src/components/ui` (compose instead of modifying).",
    "Keep backend architecture as a single Motoko actor; no additional backend services."
  ],
  "nonGoals": [
    "No changes to backend data models, room package seed data, or package/product query methods unless strictly required for the UI changes.",
    "No new authentication flows or role/permission changes.",
    "No checkout/cart business logic changes beyond what is required to support the updated display."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}