{
  "kind": "build_request",
  "title": "Add global product search and a Furniture menu with subcategories in Products by Category",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "Add a backend API to search across all products (global search), matching the query against at least product name and description, and return a list of matching Product items.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add search option for all products."
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a public query method that accepts a text query and returns matching products.",
        "Search is case-insensitive.",
        "If the query is empty/whitespace, the method returns an empty list (not a trap)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add a Furniture category structure to the backend product catalog that supports a Furniture parent category and separate furniture subcategory options for: Sofa, Center Table, Dining Table, Corner Table, King Size Bed, Queen Size Bed, Bed Side Tables, Dressing Table, Study Table, Sofa Chairs, Recliners, and Crockery Unit.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add furniture menu in products by category and give all available options of furniture for example, sofa, center table, dining table, corner table, king size bed, queen size bed, bed side tables, dressing table, study table, sofa chairs, recliners, crockery unit etc"
        ]
      },
      "acceptanceCriteria": [
        "Product categories include a Furniture parent category and individual subcategories corresponding to each of the listed furniture types.",
        "Each furniture subcategory has a stable category id and appears in the list returned by getProductCategories().",
        "Each furniture subcategory has at least one Product seeded so the UI can display results."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add a frontend global product search experience that allows users to search across all products from the Shop area and view results with product cards consistent with existing product listing cards (image, name, description, price, stock, add-to-cart).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add search option for all products."
        ]
      },
      "acceptanceCriteria": [
        "A search input is available from the shopping flow (e.g., on /shop and/or /products) and is clearly labeled in English (e.g., \"Search products\").",
        "Submitting a search shows matching products using the backend global search API.",
        "Search results handle loading, empty, and error states with user-facing text in English.",
        "Users can add products from search results to the cart using the existing add-to-cart behavior."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Update the Products by Category page to include a dedicated Furniture menu/section that lists all available furniture options (Sofa, Center Table, Dining Table, Corner Table, King Size Bed, Queen Size Bed, Bed Side Tables, Dressing Table, Study Table, Sofa Chairs, Recliners, Crockery Unit) and lets users navigate directly to each furniture subcategory’s product listing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add furniture menu in products by category and give all available options of furniture for example, sofa, center table, dining table, corner table, king size bed, queen size bed, bed side tables, dressing table, study table, sofa chairs, recliners, crockery unit etc"
        ]
      },
      "acceptanceCriteria": [
        "/products shows a Furniture section/menu with links/buttons for each listed furniture option.",
        "Clicking a furniture option navigates to the corresponding category detail page and displays that option’s products.",
        "The Furniture section does not break or hide existing non-furniture categories; they remain accessible from /products."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Wire frontend data hooks for global product search using React Query, keeping query keys stable and ensuring searches are cancellable/debounced to avoid excessive requests while typing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add search option for all products."
        ]
      },
      "acceptanceCriteria": [
        "A new React Query hook exists for product search and calls the backend search method.",
        "Typing into the search input does not trigger an unbounded number of requests (debounce or explicit submit).",
        "Query keys include the search text so results cache correctly per query."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Only add a migration file (backend/migration.mo) if required by state/schema changes; follow the conditional migration policy.",
    "Do not edit files under frontend immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui). Compose existing UI components instead."
  ],
  "nonGoals": [
    "Do not add third-party search services or external databases.",
    "Do not implement third-party authentication providers; keep Internet Identity as-is.",
    "Do not redesign unrelated pages (packages, designers, checkout) beyond what is needed to add search and the furniture menu."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}