{
  "kind": "build_request",
  "title": "Add Havenly-like product category browsing (Shop) with backend-managed catalog",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Implement backend support for a Havenly-like product category catalog, including data types and query/mutation APIs to manage categories and their products.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add product category same as https://havenly.com/"
        ]
      },
      "acceptanceCriteria": [
        "Backend defines a ProductCategory type (at minimum: id, name, description, imageUrl, sortOrder) and a Product type (at minimum: id, categoryId, name, brand, imageUrl, productUrl, optional priceINR, optional tags).",
        "Backend exposes query endpoints to list all product categories and to list products by category (and optionally fetch a single product by id).",
        "Backend exposes admin-gated mutation endpoints to create/update categories and products (following the same admin authorization pattern used by addPackage/addDesigner).",
        "All new endpoints compile and are callable from the generated frontend actor bindings."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Add React Query hooks to load the product categories and category products from the backend actor, following existing patterns in frontend/src/hooks/useQueries.ts.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add product category same as https://havenly.com/"
        ]
      },
      "acceptanceCriteria": [
        "Frontend provides hooks to fetch: (1) all product categories, (2) products for a given category id, using TanStack React Query.",
        "Hooks are disabled until the actor is ready (consistent with existing useGetPackages/useGetDesigners patterns).",
        "Queries use stable queryKeys (e.g., ['productCategories'] and ['productsByCategory', categoryId])."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Create a public product category browsing experience similar in concept to Havenly: a categories landing page with category cards and a category detail page showing products for that category.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add product category same as https://havenly.com/"
        ]
      },
      "acceptanceCriteria": [
        "A new public route exists for categories (e.g., /products) that lists all categories with image, name, and short description, sorted by sortOrder.",
        "A new public route exists for category detail (e.g., /products/$categoryId) that shows the selected category title/description and a grid of products.",
        "Each product card shows at minimum: image, name, brand (if present), and either priceINR (formatted as INR) or hides price cleanly when absent.",
        "Each product card includes a clear external link CTA (e.g., “View product”) using the productUrl; external links open in a new tab and use safe rel attributes.",
        "Loading, empty, and error states are handled gracefully on both pages."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Add navigation entry points to the new product category pages in the site header (desktop + mobile) so users can discover the product categories from anywhere on the marketing site.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add product category same as https://havenly.com/"
        ]
      },
      "acceptanceCriteria": [
        "Site header navigation includes a new link (label in English) that routes to the categories landing page (e.g., “Shop” or “Products”).",
        "The new navigation link is present in both desktop navigation and the mobile sheet menu.",
        "Navigation styling remains consistent with existing header links and active state behavior."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Add initial seed data for product categories and products so the new UI is populated in development without requiring manual admin actions.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add product category same as https://havenly.com/"
        ]
      },
      "acceptanceCriteria": [
        "Backend includes a small, sensible default set of categories (at least 6) and products (at least 3 per category) that can be returned by the query APIs.",
        "Seed data uses static imageUrl paths that point to frontend public assets (e.g., /assets/generated/...) and uses realistic productUrl placeholders (valid URLs).",
        "Seeding does not require authentication to view categories/products; only mutations remain admin-gated."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any path listed in frontend.immutablePaths.",
    "User-facing text must be in English."
  ],
  "nonGoals": [
    "Implementing a shopping cart, checkout flow, or payments.",
    "Implementing real-time inventory, vendor syncing, or third-party commerce integrations.",
    "Implementing user reviews/ratings for products."
  ],
  "imageRequirements": {
    "required": [
      "Square category thumbnail illustration/photo: Indian living room furnishings (category-living-room.dim_800x800.png)",
      "Square category thumbnail illustration/photo: Indian bedroom furnishings (category-bedroom.dim_800x800.png)",
      "Square category thumbnail illustration/photo: Indian dining room furnishings (category-dining.dim_800x800.png)",
      "Square category thumbnail illustration/photo: Indian home office furnishings (category-office.dim_800x800.png)",
      "Square category thumbnail illustration/photo: Indian decor & lighting styling elements (category-decor-lighting.dim_800x800.png)",
      "Square category thumbnail illustration/photo: Indian rugs & textiles styling elements (category-rugs-textiles.dim_800x800.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}