{
  "kind": "build_request",
  "title": "Expand product catalog with room-wise furniture plus Furnishing and Decor categories (seeded with free sample images)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-21",
      "text": "Expand the backend-seeded product category catalog so the public \"/products\" experience includes comprehensive room-wise furniture categories, each populated with many furniture products, and ensure the catalog is automatically available without any manual/admin initialization.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "add all types of furniture products under different room category. also add furnishing and decor category. take free sample images from internet"
        ]
      },
      "acceptanceCriteria": [
        "Calling getProductCategories returns a non-empty list of categories on a fresh deploy (no manual admin actions required).",
        "At minimum, the catalog includes categories for Living Room, Bedroom, Dining Room, Home Office, and Kids Room, each containing multiple furniture products (not empty).",
        "Each seeded product has non-empty: id, name, description, imageUrl, and a valid roomType + stylePreference value.",
        "Calling getProductsByCategory(categoryId) for each seeded category returns a non-empty product list."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Add two new backend product categories named \"Furnishing\" and \"Decor\" and seed each category with a comprehensive product list (e.g., Furnishing: curtains, rugs, cushions, bedding; Decor: wall art, lamps, mirrors, vases), using free sample product image URLs from the public internet.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "also add furnishing and decor category. take free sample images from internet"
        ]
      },
      "acceptanceCriteria": [
        "getProductCategories includes categories with name exactly \"Furnishing\" and \"Decor\".",
        "Both \"Furnishing\" and \"Decor\" categories have multiple seeded products (not empty).",
        "All seeded products in these categories include external imageUrl values (http/https) that are intended to be free-to-use sample images.",
        "The existing frontend product category detail page can render these categories/products without requiring any frontend code changes (i.e., data shape matches current Product and ProductCategory types)."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Ensure all newly added seeded products across all categories use free sample image URLs from the public internet and keep the UI resilient to image hotlink failures (i.e., the product grids should still render even if some external images fail).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "take free sample images from internet"
        ]
      },
      "acceptanceCriteria": [
        "Newly seeded products reference external image URLs from free image sources (e.g., Unsplash-style direct links).",
        "If an external image fails to load, the UI falls back to the existing SafeExternalImage fallback image and does not break the product grid layout.",
        "The /products page lists the expanded set of categories (including Furnishing and Decor) and each category page renders a product grid with the seeded items."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit any frontend files under frontend/src/components/ui (read-only UI component sources).",
    "Do not modify immutable frontend hook files listed in SYSTEM_CONTEXT (compose around them instead).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding admin UI for managing categories/products.",
    "Uploading/hosting/caching external images on-chain or in canister assets.",
    "Implementing licensing/attribution workflows for third-party images."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}