{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Global product search UI and Furniture subcategory menu in Products by Category",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Add a global product search UI in the Shop browsing flow and render results with existing-style product cards and add-to-cart behavior.",
      "acceptanceCriteria": [
        "A search input is available from the shopping flow (e.g., on /shop and/or /products) and is clearly labeled in English (e.g., \"Search products\").",
        "Submitting a search shows matching products using the backend global search API.",
        "Search results handle loading, empty, and error states with user-facing text in English.",
        "Users can add products from search results to the cart using the existing add-to-cart behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/products/ProductListingCard.tsx",
          "operation": "create",
          "description": "Create a reusable product listing card UI (image, name, description, price, stock, add-to-cart) consistent with existing category listing cards by composing existing components (e.g., SafeExternalImage, AddToCartButton, Card). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/products/GlobalProductSearchPanel.tsx",
          "operation": "create",
          "description": "Create a global product search panel (labeled input + results region) that uses the global search React Query hook, renders loading/empty/error text in English, and displays results using ProductListingCard. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/products/ShopLandingPage.tsx",
          "operation": "modify",
          "description": "Add the GlobalProductSearchPanel to the /shop page so search is available from the shopping flow without introducing a new top-level route. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/products/ProductCategoryDetailPage.tsx",
          "operation": "modify",
          "description": "Refactor product rendering to use ProductListingCard so search results and category listings remain visually consistent and share the same add-to-cart behavior. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Add a dedicated Furniture section on /products with links for each furniture option and a subcategory listing page for navigation.",
      "acceptanceCriteria": [
        "/products shows a Furniture section/menu with links/buttons for each listed furniture option.",
        "Clicking a furniture option navigates to the corresponding category detail page and displays that option’s products.",
        "The Furniture section does not break or hide existing non-furniture categories; they remain accessible from /products."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/products/FurnitureSubCategoryPage.tsx",
          "operation": "create",
          "description": "Create a furniture subcategory product listing page that loads products for the selected FurnitureSubCategory and renders them with ProductListingCard, including loading/empty/error states in English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new route under the existing /products area for furniture subcategory browsing (e.g., /products/furniture/$subCategory) so Furniture menu navigation is wired and not orphaned. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/products/ProductCategoriesPage.tsx",
          "operation": "modify",
          "description": "Add a dedicated Furniture menu/section above the existing categories grid, listing buttons/links for Sofa, Center Table, Dining Table, Corner Table, King Size Bed, Queen Size Bed, Bed Side Tables, Dressing Table, Study Table, Sofa Chairs, Recliners, and Crockery Unit, each linking to the new furniture subcategory route; keep existing non-furniture categories visible and accessible. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Add stable React Query hooks for global product search with debounced/cancellable searching and stable query keys.",
      "acceptanceCriteria": [
        "A new React Query hook exists for product search and calls the backend search method.",
        "Typing into the search input does not trigger an unbounded number of requests (debounce or explicit submit).",
        "Query keys include the search text so results cache correctly per query."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useDebouncedValue.ts",
          "operation": "create",
          "description": "Add a small debouncing hook used by the search UI to avoid excessive requests while typing (e.g., debounce the search text before enabling the React Query search). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query hook for global product search that calls the backend globalProductSearch(searchTerm), uses a stable query key that includes the normalized search text, and avoids running for empty/whitespace terms; also add a hook to fetch products by furniture subcategory using getProductsByFurnitureSubCategory(subCategory) for the Furniture subcategory page. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/products/GlobalProductSearchPanel.tsx",
          "operation": "modify",
          "description": "Wire debouncing/cancellation behavior by using useDebouncedValue and the global search hook so typing does not create an unbounded number of requests and results cache by query text. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}