{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Vendors UI: Listing + OTP-based Vendor Registration (GST required)",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Add a Vendors page/route with navigation access and a vendor list fetched from the backend.",
      "acceptanceCriteria": [
        "A new Vendors page/route is available in the app and is reachable from the site navigation (desktop and mobile).",
        "The Vendors page fetches and displays vendor entries from the backend with a sensible empty state when no vendors exist.",
        "The UI uses English user-facing text for headings, buttons, and error/empty states."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/vendors/VendorsPage.tsx",
          "operation": "create",
          "description": "Create the Vendors page that renders a vendor list (loading/error/empty states) and provides access to the vendor registration flow. Use existing shadcn-ui components (e.g., Card, Button, Skeleton/Alert where available) to compose the UI—Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new TanStack Router route for the Vendors page (e.g., /vendors) and include it in the route tree so the page is navigable."
        },
        {
          "path": "frontend/src/components/navigation/SiteHeader.tsx",
          "operation": "modify",
          "description": "Add a 'Vendors' link to the desktop navLinks and to the mobile menu so the Vendors page is reachable from site navigation on all breakpoints. Use existing navigation/link patterns and existing shadcn-ui components already in use—Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/navigation/SiteFooter.tsx",
          "operation": "modify",
          "description": "Add a footer link to the Vendors page to improve discoverability and ensure navigation access beyond the header."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Create a two-step vendor registration UI that requires GST and verifies mobile via OTP before final submission.",
      "acceptanceCriteria": [
        "The registration form enforces GST number as required on the client side (cannot proceed without it).",
        "The user can request an OTP for the entered mobile number and then enter the OTP to verify it.",
        "The UI prevents final submission until OTP verification succeeds (or the backend enforces and the UI reflects the error clearly).",
        "On successful registration, the user sees a clear success message and the new vendor appears in the vendor list after refresh (or automatic query invalidation)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/vendors/VendorRegistrationCard.tsx",
          "operation": "create",
          "description": "Implement the vendor registration UI as a reusable component with a two-step flow: vendor details (name, mobile, mandatory GST) + 'Request OTP', then OTP entry + 'Verify OTP', and only then enable 'Register'. Use existing shadcn-ui form inputs/buttons/cards and present clear English validation and error messages—Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/vendors/VendorsPage.tsx",
          "operation": "modify",
          "description": "Wire VendorRegistrationCard into the Vendors page (inline section or dialog) and ensure successful registration triggers a visible success message and refreshes the displayed vendor list."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add React Query hooks for vendor listing, OTP request/verify, and vendor registration following existing query/mutation patterns.",
      "acceptanceCriteria": [
        "Frontend has dedicated query hook(s) for fetching vendors and mutation hook(s) for requesting OTP, verifying OTP, and registering a vendor.",
        "After successful vendor registration, vendor list queries are invalidated/refetched so the UI updates without a manual reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add vendor-focused React Query hooks consistent with existing patterns: a vendors list query (using backend getAllVendors) and mutations for requestOtp, verifyOtp, and registerVendor. Ensure register success invalidates/refetches the vendors query key so VendorsPage updates without manual reload."
        },
        {
          "path": "frontend/src/pages/vendors/VendorsPage.tsx",
          "operation": "modify",
          "description": "Adopt the new vendors query hook for data fetching and use the shared query key(s) expected by invalidation after registration."
        },
        {
          "path": "frontend/src/components/vendors/VendorRegistrationCard.tsx",
          "operation": "modify",
          "description": "Use the new OTP request/verify and vendor registration mutation hooks, and reflect mutation states (loading/disabled) and backend errors clearly in the UI using existing shadcn-ui feedback patterns—Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}