{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Product catalog enhancements: add global product search and expand Products-by-Category with a Furniture menu including detailed furniture subcategories.",
  "architectural_notes": [],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-add-a-frontend-global-product-search-experience-that-allows-users-to-search-across-all-products-from-the-shop-area-and-view-results-with-product-cards-consistent-with-existing-product-listing-cards-image-name-description-price-stock-add-to-cart",
      "title": "Add a frontend global product search experience that allows users to search across all products from the Shop area and view results with product cards consistent with existing product listing cards (image, name, description, price, stock, add-to-cart).",
      "reqIds": [
        "REQ-6"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-products-by-category-page-to-include-a-dedicated-furniture-menu-section-that-lists-all-available-furniture-options-sofa-center-table-dining-table-corner-table-king-size-bed-queen-size-bed-bed-side-tables-dressing-table-study-table-sofa-chairs-recliners-crockery-unit-and-lets-users-navigate-directly-to-each-furniture-subcategory-s-product-listing",
      "title": "Update the Products by Category page to include a dedicated Furniture menu/section that lists all available furniture options (Sofa, Center Table, Dining Table, Corner Table, King Size Bed, Queen Size Bed, Bed Side Tables, Dressing Table, Study Table, Sofa Chairs, Recliners, Crockery Unit) and lets users navigate directly to each furniture subcategory’s product listing.",
      "reqIds": [
        "REQ-7"
      ],
      "version": 1
    },
    {
      "id": "feature-wire-frontend-data-hooks-for-global-product-search-using-react-query-keeping-query-keys-stable-and-ensuring-searches-are-cancellable-debounced-to-avoid-excessive-requests-while-typing",
      "title": "Wire frontend data hooks for global product search using React Query, keeping query keys stable and ensuring searches are cancellable/debounced to avoid excessive requests while typing.",
      "reqIds": [
        "REQ-8"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Add a search option to search across all products (global product search).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Add a Furniture menu under Products by Category with furniture type options (e.g., sofa, center table, dining table, corner table, king/queen bed, bedside tables, dressing table, study table, sofa chairs, recliners, crockery unit, etc.).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Add a backend API to search across all products (global search), matching the query against at least product name and description, and return a list of matching Product items.",
      "reqIds": [
        "REQ-4"
      ],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Add a Furniture category structure to the backend product catalog that supports a Furniture parent category and separate furniture subcategory options for: Sofa, Center Table, Dining Table, Corner Table, King Size Bed, Queen Size Bed, Bed Side Tables, Dressing Table, Study Table, Sofa Chairs, Recliners, and Crockery Unit.",
      "reqIds": [
        "REQ-5"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Add global product search and a Furniture menu with subcategories in Products by Category",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}